// The configuration can be edited in config.yaml. This file is generated on build based on the YAML config.

pub const TITLE_ENABLED: bool = true;
pub const TITLE_KEY: &'static str = "";
pub const OS_PRIORITY: usize = 2;
pub const OS_ENABLED: bool = true;
pub const OS_KEY: &'static str = "\x1b[38;2;177;156;217;mOS\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const HOST_PRIORITY: usize = 3;
pub const HOST_ENABLED: bool = true;
pub const HOST_KEY: &'static str = "\x1b[38;2;177;156;217;mHost\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const KERNEL_PRIORITY: usize = 4;
pub const KERNEL_ENABLED: bool = true;
pub const KERNEL_KEY: &'static str = "\x1b[38;2;177;156;217;mKernel\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const UPTIME_PRIORITY: usize = 5;
pub const UPTIME_ENABLED: bool = true;
pub const UPTIME_KEY: &'static str = "\x1b[38;2;177;156;217;mUptime\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const SHELL_PRIORITY: usize = 6;
pub const SHELL_ENABLED: bool = true;
pub const SHELL_KEY: &'static str = "\x1b[38;2;177;156;217;mShell\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const DE_PRIORITY: usize = 7;
pub const DE_ENABLED: bool = true;
pub const DE_KEY: &'static str = "\x1b[38;2;177;156;217;mDE\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const THEME_PRIORITY: usize = 8;
pub const THEME_ENABLED: bool = true;
pub const THEME_KEY: &'static str = "\x1b[38;2;177;156;217;mTheme\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const CURSOR_PRIORITY: usize = 9;
pub const CURSOR_ENABLED: bool = true;
pub const CURSOR_KEY: &'static str = "\x1b[38;2;177;156;217;mCursor\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const CPU_PRIORITY: usize = 10;
pub const CPU_ENABLED: bool = true;
pub const CPU_KEY: &'static str = "\x1b[38;2;177;156;217;mCPU\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const GPU_PRIORITY: usize = 11;
pub const GPU_ENABLED: bool = true;
pub const GPU_KEY: &'static str = "\x1b[38;2;177;156;217;mGPU\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const RAM_PRIORITY: usize = 12;
pub const RAM_ENABLED: bool = true;
pub const RAM_KEY: &'static str = "\x1b[38;2;177;156;217;mMemory\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const SWAP_PRIORITY: usize = 13;
pub const SWAP_ENABLED: bool = true;
pub const SWAP_KEY: &'static str = "\x1b[38;2;177;156;217;mSwap\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const LOCALE_PRIORITY: usize = 14;
pub const LOCALE_ENABLED: bool = true;
pub const LOCALE_KEY: &'static str = "\x1b[38;2;177;156;217;mLocale\x1b[38;2;255;105;97;m:\x1b[0m ";
pub const STANDARD_PALETTE_ENABLED: bool = true;
pub const STANDARD_PALETTE_KEY: &'static str = "";
pub const BRIGHT_PALETTE_ENABLED: bool = true;
pub const BRIGHT_PALETTE_KEY: &'static str = "";
pub const VALUES_COLOR: &'static str = "\x1b[38;2;238;193;203;m";
pub const TITLE_COLOR: &'static str = "\x1b[38;2;177;156;217;m";
pub const LOGO_ENABLED: bool = true;
const LOGO_FALLBACK: &'static str = "\x1b[38;2;150;124;226;m          ▗▄▄▄       \x1b[38;2;137;81;193;m▗▄▄▄▄    ▄▄▄▖[0m             \n\x1b[38;2;150;124;226;m          ▜███▙       \x1b[38;2;137;81;193;m▜███▙  ▟███▛[0m             \n\x1b[38;2;150;124;226;m           ▜███▙       \x1b[38;2;137;81;193;m▜███▙▟███▛[0m              \n\x1b[38;2;150;124;226;m            ▜███▙       \x1b[38;2;137;81;193;m▜██████▛[0m               \n\x1b[38;2;150;124;226;m     ▟█████████████████▙ \x1b[38;2;137;81;193;m▜████▛     \x1b[38;2;150;124;226;m▟▙[0m         \n\x1b[38;2;150;124;226;m    ▟███████████████████▙ \x1b[38;2;137;81;193;m▜███▙    \x1b[38;2;150;124;226;m▟██▙[0m        \n\x1b[38;2;137;81;193;m           ▄▄▄▄▖           ▜███▙  \x1b[38;2;150;124;226;m▟███▛[0m        \n\x1b[38;2;137;81;193;m          ▟███▛             ▜██▛ \x1b[38;2;150;124;226;m▟███▛[0m         \n\x1b[38;2;137;81;193;m         ▟███▛               ▜▛ \x1b[38;2;150;124;226;m▟███▛[0m          \n\x1b[38;2;137;81;193;m▟███████████▛                  \x1b[38;2;150;124;226;m▟██████████▙[0m    \n\x1b[38;2;137;81;193;m▜██████████▛                  \x1b[38;2;150;124;226;m▟███████████▛[0m    \n\x1b[38;2;137;81;193;m      ▟███▛ \x1b[38;2;150;124;226;m▟▙               ▟███▛[0m             \n\x1b[38;2;137;81;193;m     ▟███▛ \x1b[38;2;150;124;226;m▟██▙             ▟███▛[0m              \n\x1b[38;2;137;81;193;m    ▟███▛  \x1b[38;2;150;124;226;m▜███▙           ▝▀▀▀▀[0m               \n\x1b[38;2;137;81;193;m    ▜██▛    \x1b[38;2;150;124;226;m▜███▙ \x1b[38;2;137;81;193;m▜██████████████████▛[0m         \n\x1b[38;2;137;81;193;m     ▜▛     \x1b[38;2;150;124;226;m▟████▙ \x1b[38;2;137;81;193;m▜████████████████▛[0m          \n\x1b[38;2;150;124;226;m           ▟██████▙       \x1b[38;2;137;81;193;m▜███▙[0m                \n\x1b[38;2;150;124;226;m          ▟███▛▜███▙       \x1b[38;2;137;81;193;m▜███▙[0m               \n\x1b[38;2;150;124;226;m         ▟███▛  ▜███▙       \x1b[38;2;137;81;193;m▜███▙[0m              \n\x1b[38;2;150;124;226;m         ▝▀▀▀    ▀▀▀▀▘       \x1b[38;2;137;81;193;m▀▀▀▘[0m              \n";
const NIXOS_LOGO: &'static str = "\x1b[38;2;150;124;226;m          ▗▄▄▄       \x1b[38;2;137;81;193;m▗▄▄▄▄    ▄▄▄▖[0m             \n\x1b[38;2;150;124;226;m          ▜███▙       \x1b[38;2;137;81;193;m▜███▙  ▟███▛[0m             \n\x1b[38;2;150;124;226;m           ▜███▙       \x1b[38;2;137;81;193;m▜███▙▟███▛[0m              \n\x1b[38;2;150;124;226;m            ▜███▙       \x1b[38;2;137;81;193;m▜██████▛[0m               \n\x1b[38;2;150;124;226;m     ▟█████████████████▙ \x1b[38;2;137;81;193;m▜████▛     \x1b[38;2;150;124;226;m▟▙[0m         \n\x1b[38;2;150;124;226;m    ▟███████████████████▙ \x1b[38;2;137;81;193;m▜███▙    \x1b[38;2;150;124;226;m▟██▙[0m        \n\x1b[38;2;137;81;193;m           ▄▄▄▄▖           ▜███▙  \x1b[38;2;150;124;226;m▟███▛[0m        \n\x1b[38;2;137;81;193;m          ▟███▛             ▜██▛ \x1b[38;2;150;124;226;m▟███▛[0m         \n\x1b[38;2;137;81;193;m         ▟███▛               ▜▛ \x1b[38;2;150;124;226;m▟███▛[0m          \n\x1b[38;2;137;81;193;m▟███████████▛                  \x1b[38;2;150;124;226;m▟██████████▙[0m    \n\x1b[38;2;137;81;193;m▜██████████▛                  \x1b[38;2;150;124;226;m▟███████████▛[0m    \n\x1b[38;2;137;81;193;m      ▟███▛ \x1b[38;2;150;124;226;m▟▙               ▟███▛[0m             \n\x1b[38;2;137;81;193;m     ▟███▛ \x1b[38;2;150;124;226;m▟██▙             ▟███▛[0m              \n\x1b[38;2;137;81;193;m    ▟███▛  \x1b[38;2;150;124;226;m▜███▙           ▝▀▀▀▀[0m               \n\x1b[38;2;137;81;193;m    ▜██▛    \x1b[38;2;150;124;226;m▜███▙ \x1b[38;2;137;81;193;m▜██████████████████▛[0m         \n\x1b[38;2;137;81;193;m     ▜▛     \x1b[38;2;150;124;226;m▟████▙ \x1b[38;2;137;81;193;m▜████████████████▛[0m          \n\x1b[38;2;150;124;226;m           ▟██████▙       \x1b[38;2;137;81;193;m▜███▙[0m                \n\x1b[38;2;150;124;226;m          ▟███▛▜███▙       \x1b[38;2;137;81;193;m▜███▙[0m               \n\x1b[38;2;150;124;226;m         ▟███▛  ▜███▙       \x1b[38;2;137;81;193;m▜███▙[0m              \n\x1b[38;2;150;124;226;m         ▝▀▀▀    ▀▀▀▀▘       \x1b[38;2;137;81;193;m▀▀▀▘[0m              \n";

pub fn get_logo(id: &str, fallback_id: &str) -> &'static str {
	match id {
		"nixos" => NIXOS_LOGO,
		_ => match fallback_id {
			"nixos" => NIXOS_LOGO,
			_ => LOGO_FALLBACK,
		},
	}
}
